{
  "name": "English",
  "code": "en_US",
  "texts": {
    "language": "Language",
    "dob": "DOB: ",
    "phone": "PHONE: ",
    "address": "ADDRESS: ",
    "about_me": "ABOUT ME",
    "vision": "DEVELOPMENT VISION",
    "skills": "SKILLS",
    "education": "EDUCATIONS",
    "projects": "PROJECTS",
    "soft_skills": "Soft Skills",
    "contact": "CONTACT ME",
    "my_name": "HUYNH HUNG PHAT",
    "my_address": "20/6 Kha Van Can Street, Hiep Binh Chanh Ward, Thu Duc District, Ho Chi Minh City.",
    "my_about": "I am a Flutter developer with expertise in UI/UX design for web and mobile applications. I constantly strive to improve my skills in building intuitive and accessible experiences, ensuring smooth and responsive applications through performance optimization. I also utilize GetX for state management in my Flutter projects. Additionally, I learn Node.js for backend development, utilizing cloud services like AWS (S3, Cloudfront) and Cloudinary for managing storage and media. I'm actively improve caching data with Redis, learning RabbitMQ to further enhance my backend capabilities.",
    "my_frontend": "Flutter (Web, Android): Building a Responsive Website/Android App with Flutter using Getx at State manager, custom theme, multi language app",
    "my_backend": "Golang (Gin/Gorm), NodeJs(Express), Firebase, Golang",
    "my_database": "Mysql, MongoDB, Firestore, Redis",
    "my_soft_skill": "Creativity, Problem Solving, Adopting Innovation, Self-Motivation.",
    "my_education": "Nong Lam Univversity (09/2017 - 06/2022)\nEngineer's Degree of Information Technology with GPA: 2.4/4.0.",
    "my_project": "Github Page: vemines.github.io",
    "my_project_1": "NodeJs",
    "my_project_detail": "A collection widget, useful package example for save time coding.",
    "my_project_1_detail": "General all my knowledge about NodeJs, learn a lot of technology about RestApi, AWS (S3, Cloudfront), RabbitMQ, Cloudinary and usecase for optimize backend skill",
    "my_vision": "Improve backend/frontend optimize.\nUpgrage perfomence/security app.\nLearn more technology\nImprove coding speed and clean code."
  }
}
