{
  "name": "Tiếng Việt",
  "code": "vi_VN",
  "texts": {
    "language": "Ngôn ngữ",
    "dob": "NGÀY SINH: ",
    "phone": "SỐ ĐIỆN THOẠI: ",
    "my_phone": "0946360458",
    "my_email": "vemines@outlook.com",
    "github": "github.com/vemines",
    "address": "ĐỊA CHỈ: ",
    "about": "GIỚI THIỆU BẢN THÂN",
    "vision": "ĐỊNH HƯỚNG PHÁT TRIỂN",
    "skills": "CÔNG NGHỆ",
    "education": "HỌC VẤN",
    "projects": "DỰ ÁN",
    "contact": "THÔNG TIN LIÊN LẠC",
    "my_name": "HUỲNH HƯNG PHÁT",
    "my_address": "20/6 Đường Kha Vạn Cân, Phường Hiệp Bình Chánh, Quận Thủ Đức, Thành phố Hồ Chí Minh.",
    "my_about":  "Tôi là một developer Flutter với chuyên môn về thiết kế UI/UX cho ứng dụng di động và website. Tôi luôn nỗ lực nâng cao kỹ năng xây dựng trải nghiệm người dùng trực quan và dễ tiếp cận, đảm bảo ứng dụng mượt mà và nhạy bén thông qua tối ưu hóa hiệu suất. Tôi sử dụng GetX và Bloc để quản lý trạng thái trong các dự án Flutter của mình. Ngoài ra, tôi sử dụng NodeJS để phát triển backend, kết hợp các dịch vụ đám mây như AWS (S3, Cloudfront) và Cloudinary để quản lý lưu trữ và media. Hiện tại, tôi đang tập trung cải thiện kỹ năng lưu trữ dữ liệu với Redis và học RabbitMQ để nâng cao khả năng phát triển backend của mình.",
    "my_frontend": "Flutter (Web, Android): Xây dựng website và ứng dụng Android đáp ứng đa nền tảng với Flutter, sử dụng GetX để quản lý trạng thái, tạo ứng dụng đa giao diện và đa ngôn ngữ.",
    "my_backend": "NodeJs (Express), Golang (Gin/Gorm), Firebase",
    "my_database": "MongoDB, Mysql, Firestore/Realtime database, Redis",
    "my_school": "Đại học Nông Lâm (09/2017 - 06/2022)",
    "my_school_info":"Tốt nghiệp Cử nhân Công nghệ thông tin với điểm số: 2.4/4.0.",
    "my_project_1": "vemines.github.io",
    "my_project_1_url": "https://vemines.github.io",
    "my_project_1_info": "Tổng hợp các Widget, giao diện và thư viện UI/UX để thiết kế ứng dụng.",
    "my_project_2": "NodeJS",
    "my_project_2_url": "https://github.com/vemines/NodeJs",
    "my_project_2_info": "Kho lưu trữ toàn diện thể hiện kiến thức của tôi về Node.js. Nó cung cấp một REST API với nhiều tính năng, các ví dụ sử dụng AWS (S3, Cloudfront), Cloudinary, RabbitMQ và các tình huống thực tế.",
    "my_vision": "Cải thiện tối ưu backend/frontend.\nTăng cường Hiệu suất/Bảo mật ứng dụng\nHọc hỏi chuyên sâu những công nghệ mới.\nCải thiện tốc độ code và viết code tốt hơn."
  }
}
