{
  "name": "Tiếng Việt",
  "code": "vi_VN",
  "texts": {
    "language": "Ngôn ngữ",
    "dob": "NGÀY SINH: ",
    "phone": "SỐ ĐIỆN THOẠI: ",
    "my_phone": "0946360458",
    "my_email": "vemines@outlook.com",
    "github": "github.com/vemines",
    "address": "ĐỊA CHỈ: ",
    "about_me": "GIỚI THIỆU BẢN THÂN",
    "vision": "ĐỊNH HƯỚNG PHÁT TRIỂN",
    "skills": "KỸ NĂNG",
    "education": "HỌC VẤN",
    "projects": "DỰ ÁN",
    "soft_skills": "Kỹ Năng Mềm",
    "contact": "THÔNG TIN LIÊN LẠC",
    "my_name": "HUỲNH HƯNG PHÁT",
    "my_address": "20/6 Đường Kha Vạn Cân, Phường Hiệp Bình Chánh, Quận Thủ Đức, Thành phố Hồ Chí Minh.",
    "my_about": "Tôi là một developer Flutter với chuyên môn về thiết kế UI/UX cho các ứng dụng web và di động. Tôi luôn nỗ lực nâng cao kỹ năng xây dựng các trải nghiệm trực quan và dễ tiếp cận, đảm bảo các ứng dụng mượt mà và nhạy bén thông qua việc tối ưu hóa hiệu suất. Tôi cũng sử dụng GetX để quản lý trạng thái trong các dự án Flutter của mình. Ngoài ra, tôi đang học Node.js để phát triển backend, sử dụng các dịch vụ đám mây như AWS (S3, Cloudfront) và Cloudinary để quản lý lưu trữ và media. Tôi đang tích cực cải thiện việc lưu trữ dữ liệu với Redis, học RabbitMQ để nâng cao hơn nữa khả năng backend của mình.",
    "my_frontend": "Flutter (Web, Android): Xây dựng trang web responsive hoặc ứng dụng Android bằng Flutter sử dụng Getx để State manager, custom nhiều theme, ứng dụng đa ngôn ngữ",
    "my_backend": "Golang (Gin/Gorm), NodeJs(Express), Firebase, Golang",
    "my_database": "Mysql, MongoDB, Firestore, Redis",
    "my_soft_skill": "Sáng tạo, Giải quyết vấn đề, Áp dụng đổi mới, Tự thúc đẩy bản thân.",
    "my_education_school": "Đại học Nông Lâm (09/2017 - 06/2022):",
    "my_education": "Tốt nghiệp kỹ sư Công nghệ thông tin với điểm số: 2.4/4.0.",
    "my_project": "vemines.github.io",
    "my_project_url": "https://vemines.github.io",
    "my_project_1": "NodeJS",
    "my_project_1_url": "https://github.com/vemines/NodeJs",
    "my_project_detail": "Danh sách Widget/Package hữu ích để code tốt hơn.",
    "my_project_1_detail": "Tổng hợp kiến thức về Nodejs, dùng để tạo RestApi, kết nối AWS (S3, Cloudfront), RabbitMQ, Cloudinary và một số code khác về NodeJs",
    "my_vision": "Cải thiện tối ưu backend/frontend.\nTăng cường Hiệu suất/Bảo mật ứng dụng\nHọc hỏi thêm nhều công nghệ mới.\nCải thiện tốc độ code và viết code tốt hơn."
  }
}
